Public Attributes | List of all members
API_GetParamValuesType Struct Reference
Library Part Management
The possible parameter values of a non-array Library Part parameter. More...
#include <APIdefs_Goodies.h>
 Public Attributes
char  | name [API_NameLen]
[in] the name of the parameter (optional if index is given)
short  | index
[in] the index of the parameter ( 0: A, 1: B, 2..n: other parameters); (optional if name is given)
bool  | locked
[out] the parameter is locked; i.e. the user cannot modify it
bool  | custom
[out] the parameter may have custom values (its VALUES command contains the CUSTOM keyword)
Int32  | nVals
[out] the number of values
GS::uchar_t **  | uStrValues
[out] the list of possible string values (Unicode strings in UTF-16 encoding)
API_VLNumType **  | realValues
[out] the list of possible numeric values
Detailed Description
The possible parameter values of a non-array Library Part parameter.
Remarks
The possible parameter values for the given parameter (defined by its name or index) are returned in this structure by the ACAPI_LibraryPart_GetParamValues function. For more information, see the description of the VALUES command in the Parameter Script section of the GDL Reference Manual. Remember to dispose of the strValues or the realValues handles when no longer needed.
Member Data Documentation
◆ custom
 API_GetParamValuesType::custom
[out] the parameter may have custom values (its VALUES command contains the CUSTOM keyword)
◆ index
 API_GetParamValuesType::index
[in] the index of the parameter ( 0: A, 1: B, 2..n: other parameters); (optional if name is given)
◆ locked
 API_GetParamValuesType::locked
[out] the parameter is locked; i.e. the user cannot modify it
◆ name
 API_GetParamValuesType::name
[in] the name of the parameter (optional if index is given)
◆ nVals
 API_GetParamValuesType::nVals
[out] the number of values
◆ realValues
 API_GetParamValuesType::realValues
[out] the list of possible numeric values
◆ uStrValues
 API_GetParamValuesType::uStrValues
[out] the list of possible string values (Unicode strings in UTF-16 encoding)